# SQL Database Operations
------

### 1. Create Table
```sql
CREATE TABLE employees(
    employee_id INT,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    hourly_paid DECIMAL(5, 2),
    hired_date DATE
);

### 2. Select All Records

```sql
SELECT * FROM employees;

### 3. Rename Table

```sql
RENAME TABLE employees TO workers;

### 4. DROP THE TABLE
```SQL
DROP TABLE employees;

### 5. ADD COLUMN

```SQL
ALTER TABLE employees
ADD phone_number VARCHAR(50);

### 6. RENAME COLUMN

```SQL
ALTER TABLE employees
RENAME COLUMN phone_number TO email_id;

### 7. ALTER COLUM DATATYPE
```SQL
ALTER TABLE employees
MODIFY COLUMN email_id VARCHAR(100);

### 8. Move Column Position
```SQL
ALTER TABLE employees
MODIFY email_id VARCHAR(100)
AFTER last_name;

------FIRST ----
ALTER TABLE employees
MODIFY Sno INT
FIRST;

---------DROP THE COLUMN-----------
ALTER TABLE employees
DROP COLUMN email_id;

------------

# 01 INSERT ROWS

```sql
----------INSERT THE DATA ROW INTO TABLE---------


INSERT INTO employees
VALUES(01, "jenni", "rubyjane", "jenni@gmail.com", 34.90, "2025/01/29");
SELECT * FROM employees;


--------MULITPLE VALUE INTO TABLE----------

INSERT INTO employees
VALUES(01, "jenni", "rubyjane", "jenni@gmail.com", 34.90, "2025/01/29"),
(02, "Ruka", "Weber", "ruka@gmail.com", 94.90, "2024/07/19"),
(03, "Ginger", "lord", "lord@gmail.com", 84.90, "2024/02/21"),
(04, "Luci", "Amy", "luci@gmail.com", 74.90, "2015/09/04");
SELECT * FROM employees;


-----------INSERTING SPECIFIC DATA---------

INSERT INTO employees(employee_id, first_name, last_name)
VALUES(06,"lasks", "pandi");
SELECT * FROM employees;

-------------

## 02. SELECT DATA FROM THE TABLE

```SQL

---------SELECT ALL DATA-------------

SELECT * FROM employees;

SELECT first_name, last_name FROM employees;


---------WHERE CLAUSE------

SELECT * FROM employees
WHERE employee_id = 01;

SELECT * FROM employees
WHERE first_name = "ruka";

SELECT * FROM employees
WHERE hourly_paid >= 50;

SELECT * FROM employees
WHERE employee_id != 01;

SELECT * FROM employees
WHERE hired_data is NULL;

---------

## 03. UPDATE & DELETE

```sql
------Temporarily Disable Safe Mode for the Session---------

SET SQL_SAFE_UPDATES = 0;

-------update data----

UPDATE employees
SET hourly_paid = 66.00
WHERE employee_id = 6;


----------OPTIONAL RETURN TO SAFE MODE-------

SET SQL_SAFE_UPDATES = 1;


----------MULTIPLE UPDATION --------

UPDATE employees
SET hourly_paid = 66.00,
	hired_data = "2020-10-12",
    email_id = null
WHERE employee_id = 6;
SELECT * FROM employees;


--------ALL COLUMN ONE VALUE-------

UPDATE employees
SET PF = 10.05;
SELECT * FROM employees;

----------DELETE ROW ----------

DELETE FROM employees
WHERE employee_id = 6;

SELECT * FROM employees;


delete from students
where  student_name is null
	and student_id is null
    and student_grade is null;

-----------

## 04. AUTOCOMMIT, COMMIT, ROLLBACK

```SQL

-----------ROLLBACK------------

STEP 1:
    SET SQL_SAFE_UPDATES = 0;
STEP 2:
    SET AUTOCOMMIT = OFF
STEP 3:
    COMMIT
STEP 4:
    DELETE FROM employees;
    SELECT * FROM employees;
STEP 5:
    ROLLBACK;
    SELECT * FROM EMPLOYEES;

STEP 6:
    TO SAVE THE CHANGES GIVE: COMMIT; 

STEP 7:
    SET AUTOCOMMIT = ON

------------

## 05. CURRENT DATE AND CURRENT TIME

```SQL
CREATE TABLE TEST(
   current_date date,
   current_time time,
   current_datetime datetime


);

INSERT INTO test
VALUES(current_date() -1 , current_time(), NOW());
SELECT * FROM test;

-----you can recreate it later i delete it-----
drop table test;

---------

## 06 UNIQUE CONSTRAINT

***CHECKS ALL COLUMN HAS THE UNQIUE VALUES***

```SQL

CREATE TABLE PRODUCTS(
    product_id varchar(20),
    product_name varchar(30) UNIQUE,
    price decimal(4, 2)
);


-------------IF THE CHANGE ANOTHER COLUMN HAS UNQIUE--------
ALTER TABLE PRODUCTS
ADD CONSTRAINT
UNIQUE (PRICE)


---------INSERTION ----------
INSERT INTO products
values(100, "PZZA", 45.78),
	(200, "DOSA", 20.65),
        (120, "IDLI", 56.89), 
        (22, "VADAI", 10.43),
        (204, "DOSA", 10.69); # GIVES THE ERROR NO UNIQUE ONE
SELECT * FROM products; 


----------CORRECT--------
INSERT INTO products
values(100, "PZZA", 45.78),
	(200, "DOSA", 20.65),
        (120, "IDLI", 56.89), 
        (22, "VADAI", 10.43),
SELECT * FROM products;

---------

## 07. NOT NULL CONSTRAINT

```SQL

--------1️⃣-CREATION OF TABLE -----------

CREATE TABLE PRODUCTS(
    PRODUCT_ID INT,
    PRODUCT_NAME VARCHAR(25) NOT NULL, 
    PRICE DECIMAL(4, 2)
);


----------2️⃣ AFTER CREATION OF TABLE -------

ALTER TABLE PRODUCTS
MODIFY COLUMN PRICE DECIMAL(4, 2) NOT NULL;

INSERT INTO PRODUCTS;
VALUES(12, "GINGER", NULL) # SHOWS THE ERROR

NOTE:
WE CAN GIVE 0 TO VALUE BUT NOT NULL OR EMPTY

-----------

## 08. CHECK CONSTRAINT

**When you define a CHECK constraint, the database will reject any INSERT or UPDATE operation that violates the condition specified in the constraint.**

```SQL

GIVE THE VAR TO IDENTIFY IT:

---------BEFORE CREATION OF TABLE -----------
CREATE TABLE EMPLOYEES(
    EMPLOYEE_ID INT, 
    FIRST_NAME VARCHAR(200),
    LAST_NAME VARCHAR(23),
    HOURLY_PAY DECIMAL(5, 2)
    CONSTRAINT CHK_HOURLY_PAY CHECK (HOURLY_PAY >= 10.00)  
    
    # CHK_HOURLY_PAY VARIABLE HOLDS VALUE OF CONSTRAINT
);


----------AFTER CREATION ---------

ALTER TABLE employees
ADD constraint CHECK_PAY CHECK(hourly_paid >= 10.00);

SELECT * FROM employees;

--------when we give below 10 .00 it show "VIOLATED MESSAGE"---------
insert into employees
values(5, "hooda", "deepak", "hooda@gmail.com",12, 9.00, "2020-07-06");


----------CORRECTED----------
insert into employees
values(5, "hooda", "deepak", "hooda@gmail.com",12, 12.00, "2020-07-06");


------DROP THE CHECK-------
ALTER TABLE employees
DROP check CHECK_PAY;

---------

## 09. DEFAULT CONSTARINT

```sql

set sql_safe_updates = 0


----------WHILE CREATION TABLE-------

CREATE TABLE PRODUCTS(
    PRODUCT_NAME VARCHAR(35), 
    PRODUCT_ID INT(10), 
    PRICE DECIMAL(5, 2) DEFAULT 0
);


--------AFTER CREATION TABLE--------

ALTER TABLE products
ALTER price SET DEFAULT 0


-------if no value it takes has default -----

INSERT INTO products(product_id, product_name)
VALUES(1, "straw"), (2, "tissue"), (3, "fork"), (4, "spoon");
select * FROM products;



----------table ------------
create table transaction(
	transaction_id int, 
    amount decimal (3, 2), 
    transaction_date datetime default now()
);

insert into transaction(transaction_id, amount)
value(31, 6.67);
select * from transaction;

------drop------

drop table transaction

-----------